snlkuharlocal/src/Documents/ПрайсЛистИнетМаг/ПрайсЛистИнетМаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрайсЛистИнетМаг</name>
  <comment>//Михайловский 01.10.21 утверждение цен, уст. маркет-плейсом</comment>
  <attributes>
    <name>ИнетМагазин</name>
    <comment>Инет Ресурс, с которого скачаны цены</comment>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <comment>Дата начала действия прайса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БезДоп1Р</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОкруглять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Промо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИтог</name>
      <comment>Цена для применения на ресурсе МП</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>DocumentRef.Матрица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМатрица</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСайт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиСРес</name>
    <attributes>
      <name>nmId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>discount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>promoCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Промо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Группы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитатьИтогЦену</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗагрузкиИзExcel</name>
    <attributes>
      <name>КодНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяСкидка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПланАкц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаССайта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаССайта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПромоССайта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары1</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Промо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>DocumentRef.Матрица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИтог</name>
      <comment>Цена для применения на ресурсе МП</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМатрица</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСайт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДExcel</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаМатр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВыгр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Группы1</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РассчитатьИтогЦену</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеВыгрузкиНаРес</name>
    <attributes>
      <name>nmId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>discount</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>promoCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Промо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИтог</name>
      <comment>Цена для применения на ресурсе МП</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары0</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ПрайсЛистИнетМаг/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Вставить содержимое обработчика.
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Автор) Тогда
		ЭтотОбъект.Автор=ПараметрыСеанса.Пользователь;
	КонецЕсли;
	//Если ЭтотОбъект.ТоварыАкция.Количество() Тогда
	//	Если НЕ ЭтотОбъект.Акция Тогда
	//		ЭтотОбъект.Акция=Истина;
	//	КонецЕсли;	
	//КонецЕсли;
КонецПроцедуры
#Область ОбПррайсы

//Функция НайтиСоздатьПЛ(ДатаДок,ТипЦенДок,Дата2)
//	Рез=неопределено;
//	Запрос=Новый Запрос;
//	Запрос.Текст=
//	"ВЫБРАТЬ
//	|	ПрайсЛист.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ПрайсЛист КАК ПрайсЛист
//	|ГДЕ
//	|	ПрайсЛист.Дата = &ДатаДок
//	|	И ПрайсЛист.ТипЦен = &ТипЦенДок
//	|	И ПрайсЛист.Дата2 = &Дата2";
//	Запрос.УстановитьПараметр("ДатаДок",ДатаДок);
//	Запрос.УстановитьПараметр("ТипЦенДок",ТипЦенДок);
//	Запрос.УстановитьПараметр("Дата2",Дата2);
//	Выб=Запрос.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		Рез=Выб.Ссылка;
//		Возврат Рез;
//	КонецЕсли;	
//	ДокПЛ=Документы.ПрайсЛист.СоздатьДокумент();
//	ДокПЛ.Дата=ДатаДок;
//	ДокПЛ.Дата2=Дата2;
//	ДокПЛ.ТипЦен=ТипЦенДок;
//	ДокПЛ.УровеньДоступа=ТипЦен.УровеньДоступа;
//	ДокПЛ.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
//	
//	ДокПЛ.ИБ = Справочники.ИБ.НайтиПоКоду("SMN");
//	ДокПЛ.УстановитьНовыйНомер();
//	Рез=ДокПЛ.Ссылка;
//	Возврат Рез;
//КонецФункции	

//Функция НайтиПЛ(ДатаДок,ТипЦенДок,Дата2)
//	Рез=неопределено;
//	Запрос=Новый Запрос;
//	Запрос.Текст=
//	"ВЫБРАТЬ
//	|	ПрайсЛист.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ПрайсЛист КАК ПрайсЛист
//	|ГДЕ
//	|	ПрайсЛист.Дата = &ДатаДок
//	|	И ПрайсЛист.ТипЦен = &ТипЦенДок
//	|	И ПрайсЛист.Дата2 = &Дата2";
//	Запрос.УстановитьПараметр("ДатаДок",ДатаДок);
//	Запрос.УстановитьПараметр("ТипЦенДок",ТипЦенДок);
//	Запрос.УстановитьПараметр("Дата2",Дата2);
//	Выб=Запрос.Выполнить().Выбрать();
//	Если Выб.Следующий() Тогда
//		Рез=Выб.Ссылка;
//		
//	КонецЕсли;	
//	Возврат Рез;
//КонецФункции
#КонецОбласти
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	// Вставить содержимое обработчика.
	Набор1=РегистрыСведений.ЦеныНоменклатурыИнетМаг.СоздатьНаборЗаписей();
	Набор1.Отбор.ТипЦен.Установить(ИнетМагазин);
	Набор1.Отбор.Прайс.Установить(Ссылка);
	//Если Акция Тогда
	ТЗЦен=Товары1.Выгрузить();
	//Иначе
	//	ТЗЦен=Товары.Выгрузить();
	//КонецЕсли;
	МасНом=Новый Массив;
	Для Каждого ТСтр Из ТЗЦен Цикл
		ТНоменклатура=ТСтр.Номенклатура;
		
		Если ТСтр.Расчет Тогда
			Если НЕ МасНом.Найти(ТНоменклатура)=неопределено Тогда
				Продолжить;
			КонецЕсли;
			НовЗап=Набор1.Добавить();
			НовЗап.ТипЦен=ИнетМагазин;
			НовЗап.Прайс=Ссылка;
			НовЗап.Номенклатура=ТНоменклатура;
			НовЗап.Период=Дата;
			НовЗап.Модель=ТСтр.Группа;
			НовЗап.Брэнд=ТСтр.Группа.Родитель;
			НовЗап.ТипТовара=ТСтр.Группа.Родитель.Родитель;
			//Если Акция Тогда
			НовЗап.ИДРесурс=ТСтр.ИДСайт;
			НовЗап.Цена=ТСтр.ЦенаВыгр;
			НовЗап.ЦенаСтр=Формат(ТСтр.ЦенаВыгр,"ЧДЦ=0; ЧГ=0");
			НовЗап.Скидка=ТСтр.Скидка;
			НовЗап.Промо=ТСтр.Промо;
			НовЗап.ЦенаИтог=ТСтр.ЦенаПлан;
			//НовЗап.ИнетМаг=ИнетМагазин;
			НовЗап.ДатаОкончания=Дата2;
				
			//	НовЗап.Промо=ТСтр.Промо;
			//	НовЗап.ЦенаИтог=ТСтр.ЦенаИтог;
			//КонецЕсли;
			МасНом.Добавить(ТНоменклатура);
		КонецЕсли;
	КонецЦикла;	
	Набор1.Записать();
	ТСтат=ПолучитьСтатус();
	Попытка
		Если ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.Статус) Тогда
			ТСтат=ЭтотОбъект.ДополнительныеСвойства.Статус;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	//Попытка
	//	//ДокПЛ=Документы.ПрайсЛист.СоздатьДокумент();
	//	//ДокПЛ.Дата=Дата;
	//	//ДокПЛ.ТипЦен=ТипЦен;
	//	//ДокПЛ.УровеньДоступа=ТипЦен.УровеньДоступа;
	//	//ДокПЛ.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
	//	//
	//	//ДокПЛ.ИБ = Справочники.ИБ.НайтиПоКоду("SMN");
	//	//ДокПЛ.УстановитьНовыйНомер();
	//	ДокПЛСсыл=НайтиСоздатьПЛ(Дата,ТипЦен,Дата2);
	//	
	//	ДокПЛ=ДокПЛСсыл.ПолучитьОбъект();
	//	ДокПЛ.Записать(РежимЗаписиДокумента.Проведение);
	//	//Рез=ДокПЛ.Ссылка;
	//	Набор2=РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	//	Для Каждого ТСтр Из ТЗЦен Цикл
	//		ТНоменклатура=ТСтр.Номенклатура;
	//		
	//		Если ТСтр.Расчет Тогда
	//			Если НЕ МасНом.Найти(ТНоменклатура)=неопределено Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			НовЗап=Набор2.Добавить();
	//			НовЗап.ТипЦен=ДокПЛСсыл.ТипЦен;
	//			НовЗап.Прайс=ДокПЛ.Ссылка;
	//			НовЗап.Номенклатура=ТНоменклатура;
	//			НовЗап.Брэнд=ТСтр.Группа;
	//			НовЗап.Период=Дата;
	//			НовЗап.Цена=ТСтр.ЦенаПлан;
	//			НовЗап.Модель=ТСтр.Группа.Родитель;
	//			НовЗап.УровеньДоступа=ДокПЛСсыл.ТипЦен.УровеньДоступа;
	//		КонецЕсли;	
	//	КонецЦикла;	
	//	Набор2.Записать();
	//Исключение
	//КонецПопытки;
	
	
	Если (ТСтат=Перечисления.СтатусПрайсМаркетПлейс.ГотовКВыгрузке) Тогда	
		
		МенЗап=РегистрыСведений.ИнетПрайсыКВыгрузке.СоздатьМенеджерЗаписи();
		МенЗап.Статус=ТСтат;
		МенЗап.Прайс=Ссылка;
		МенЗап.ИнетМаг=Ссылка.ИнетМагазин;
		МенЗап.Дата1=Ссылка.Дата;
		МенЗап.Дата2=Ссылка.Дата2;
		МенЗап.ДатаРегистрацииВыгрузки=ТекущаяДатаСеанса();
		//МенЗап.Статус=ЭтотОбъект.ДополнительныеСвойства.Статус;
		МенЗап.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтатус()
	Стат=Перечисления.СтатусПрайсМаркетПлейс.Новый;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	СтатусыПрайсовМаркетПлейсов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыПрайсовМаркетПлейсов КАК СтатусыПрайсовМаркетПлейсов
		|ГДЕ
		|	СтатусыПрайсовМаркетПлейсов.Документ = &Документ";
		Запрос.УстановитьПараметр("Документ",Ссылка);
		Выб=Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Стат=Выб.Статус;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Стат;
КонецФункции


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Вставить содержимое обработчика.
	//ДокПЛСсыл=НайтиПЛ(Дата,ТипЦен,Дата2);
	//Если НЕ (ДокПЛСсыл=неопределено) Тогда
	//	//Набор1=РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	//	//Набор1.Отбор.Прайс.Установить(ДокПЛСсыл);
	//	//Набор1.Очистить();
	//	ДокПЛ=ДокПЛСсыл.ПолучитьОбъект();
	//	ДокПЛ.Удалить();
	//КонецЕсли;	
	//
	Набор2=РегистрыСведений.ЦеныНоменклатурыИнетМаг.СоздатьНаборЗаписей();
	Набор2.Отбор.Прайс.Установить(Ссылка);
	Набор2.Очистить();
	Набор2.Записать();
	Набор3=РегистрыСведений.ИнетПрайсыКВыгрузке.СоздатьНаборЗаписей();
	Набор3.Отбор.Прайс.Установить(Ссылка);
	Набор3.Очистить();
	Набор3.Записать();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	// Вставить содержимое обработчика.
	Если НЕ Отказ Тогда
		Попытка
			Если ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.Статус) Тогда
				МенЗап=РегистрыСведений.СтатусыПрайсовМаркетПлейсов.СоздатьМенеджерЗаписи();
				МенЗап.ДатаИзменения=ТекущаяДатаСеанса();
				МенЗап.Документ=Ссылка;
				МенЗап.Статус=ЭтотОбъект.ДополнительныеСвойства.Статус;
				МенЗап.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры
